In [1]:
import pandas as pd

data = {
    'EmployeeID': [1, 2, 3, 4, 5],
    'Department': ['Sales', 'Engineering', 'Sales', 'Engineering', 'Sales'],
    'Salary': [60000, 80000, 75000, 95000, 50000],
    'YearsAtCompany': [2, 5, 3, 7, 1]
}
df = pd.DataFrame(data)
df

   EmployeeID   Department  Salary  YearsAtCompany
0           1        Sales   60000               2
1           2  Engineering   80000               5
2           3        Sales   75000               3
3           4  Engineering   95000               7
4           5        Sales   50000               1

Filter employees who have been with the company for more than 3 years and return a DataFrame containing only these employees.

In [2]:
df[df['YearsAtCompany']>3]

   EmployeeID   Department  Salary  YearsAtCompany
1           2  Engineering   80000               5
3           4  Engineering   95000               7

Calculate the average salary for each department and return a DataFrame with columns Department and AverageSalary.

In [5]:
df.groupby('Department')['Salary'].mean().reset_index()

    Department        Salary
0  Engineering  87500.000000
1        Sales  61666.666667